ARMmbed/DAPLink/source/common/cmsis/TARGET_Freescale/include/device/MK24F25612/MK24F25612_fmc.h
#define HW_FMC_TAGVDW3Sn(x, n)   (*(__IO hw_fmc_tagvdw3sn_t *) HW_FMC_TAGVDW3Sn_ADDR(x, n))
#define HW_FMC_TAGVDW3Sn_RD(x, n) (HW_FMC_TAGVDW3Sn(x, n).U)
#define HW_FMC_TAGVDW3Sn_WR(x, n, v) (HW_FMC_TAGVDW3Sn(x, n).U = (v))
#define HW_FMC_TAGVDW3Sn_SET(x, n, v) (HW_FMC_TAGVDW3Sn_WR(x, n, HW_FMC_TAGVDW3Sn_RD(x, n) |  (v)))
#define HW_FMC_TAGVDW3Sn_CLR(x, n, v) (HW_FMC_TAGVDW3Sn_WR(x, n, HW_FMC_TAGVDW3Sn_RD(x, n) & ~(v)))
#define HW_FMC_TAGVDW3Sn_TOG(x, n, v) (HW_FMC_TAGVDW3Sn_WR(x, n, HW_FMC_TAGVDW3Sn_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_TAGVDW3Sn bitfields
 */

/*!
 * @name Register FMC_TAGVDW3Sn, field valid[0] (RW)
 */
/*@{*/
#define BP_FMC_TAGVDW3Sn_valid (0U)        /*!< Bit position for FMC_TAGVDW3Sn_valid. */
#define BM_FMC_TAGVDW3Sn_valid (0x00000001U) /*!< Bit mask for FMC_TAGVDW3Sn_valid. */
#define BS_FMC_TAGVDW3Sn_valid (1U)        /*!< Bit field size in bits for FMC_TAGVDW3Sn_valid. */

/*! @brief Read current value of the FMC_TAGVDW3Sn_valid field. */
#define BR_FMC_TAGVDW3Sn_valid(x, n) (BITBAND_ACCESS32(HW_FMC_TAGVDW3Sn_ADDR(x, n), BP_FMC_TAGVDW3Sn_valid))

/*! @brief Format value for bitfield FMC_TAGVDW3Sn_valid. */
#define BF_FMC_TAGVDW3Sn_valid(v) ((uint32_t)((uint32_t)(v) << BP_FMC_TAGVDW3Sn_valid) & BM_FMC_TAGVDW3Sn_valid)

/*! @brief Set the valid field to a new value. */
#define BW_FMC_TAGVDW3Sn_valid(x, n, v) (BITBAND_ACCESS32(HW_FMC_TAGVDW3Sn_ADDR(x, n), BP_FMC_TAGVDW3Sn_valid) = (v))
/*@}*/

/*!
 * @name Register FMC_TAGVDW3Sn, field cache_tag[19:6] (RW)
 */
/*@{*/
#define BP_FMC_TAGVDW3Sn_cache_tag (6U)    /*!< Bit position for FMC_TAGVDW3Sn_cache_tag. */
#define BM_FMC_TAGVDW3Sn_cache_tag (0x000FFFC0U) /*!< Bit mask for FMC_TAGVDW3Sn_cache_tag. */
#define BS_FMC_TAGVDW3Sn_cache_tag (14U)   /*!< Bit field size in bits for FMC_TAGVDW3Sn_cache_tag. */

/*! @brief Read current value of the FMC_TAGVDW3Sn_cache_tag field. */
#define BR_FMC_TAGVDW3Sn_cache_tag(x, n) (HW_FMC_TAGVDW3Sn(x, n).B.cache_tag)

/*! @brief Format value for bitfield FMC_TAGVDW3Sn_cache_tag. */
#define BF_FMC_TAGVDW3Sn_cache_tag(v) ((uint32_t)((uint32_t)(v) << BP_FMC_TAGVDW3Sn_cache_tag) & BM_FMC_TAGVDW3Sn_cache_tag)

/*! @brief Set the cache_tag field to a new value. */
#define BW_FMC_TAGVDW3Sn_cache_tag(x, n, v) (HW_FMC_TAGVDW3Sn_WR(x, n, (HW_FMC_TAGVDW3Sn_RD(x, n) & ~BM_FMC_TAGVDW3Sn_cache_tag) | BF_FMC_TAGVDW3Sn_cache_tag(v)))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW0SnUM - Cache Data Storage (uppermost word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW0SnUM - Cache Data Storage (uppermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * uppermost word (bits [127:96]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw0snum
{
    uint32_t U;
    struct _hw_fmc_dataw0snum_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [127:96] of data entry */
    } B;
} hw_fmc_dataw0snum_t;

/*!
 * @name Constants and macros for entire FMC_DATAW0SnUM register
 */
/*@{*/
#define HW_FMC_DATAW0SnUM_COUNT (4U)

#define HW_FMC_DATAW0SnUM_ADDR(x, n) ((x) + 0x200U + (0x10U * (n)))

#define HW_FMC_DATAW0SnUM(x, n)  (*(__IO hw_fmc_dataw0snum_t *) HW_FMC_DATAW0SnUM_ADDR(x, n))
#define HW_FMC_DATAW0SnUM_RD(x, n) (HW_FMC_DATAW0SnUM(x, n).U)
#define HW_FMC_DATAW0SnUM_WR(x, n, v) (HW_FMC_DATAW0SnUM(x, n).U = (v))
#define HW_FMC_DATAW0SnUM_SET(x, n, v) (HW_FMC_DATAW0SnUM_WR(x, n, HW_FMC_DATAW0SnUM_RD(x, n) |  (v)))
#define HW_FMC_DATAW0SnUM_CLR(x, n, v) (HW_FMC_DATAW0SnUM_WR(x, n, HW_FMC_DATAW0SnUM_RD(x, n) & ~(v)))
#define HW_FMC_DATAW0SnUM_TOG(x, n, v) (HW_FMC_DATAW0SnUM_WR(x, n, HW_FMC_DATAW0SnUM_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW0SnUM bitfields
 */

/*!
 * @name Register FMC_DATAW0SnUM, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW0SnUM_data (0U)        /*!< Bit position for FMC_DATAW0SnUM_data. */
#define BM_FMC_DATAW0SnUM_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW0SnUM_data. */
#define BS_FMC_DATAW0SnUM_data (32U)       /*!< Bit field size in bits for FMC_DATAW0SnUM_data. */

/*! @brief Read current value of the FMC_DATAW0SnUM_data field. */
#define BR_FMC_DATAW0SnUM_data(x, n) (HW_FMC_DATAW0SnUM(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW0SnUM_data. */
#define BF_FMC_DATAW0SnUM_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW0SnUM_data) & BM_FMC_DATAW0SnUM_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW0SnUM_data(x, n, v) (HW_FMC_DATAW0SnUM_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW0SnMU - Cache Data Storage (mid-upper word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW0SnMU - Cache Data Storage (mid-upper word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-upper word (bits [95:64]) of all 4 sets (n=0-3) in way 0.
 */
typedef union _hw_fmc_dataw0snmu
{
    uint32_t U;
    struct _hw_fmc_dataw0snmu_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [95:64] of data entry */
    } B;
} hw_fmc_dataw0snmu_t;

/*!
 * @name Constants and macros for entire FMC_DATAW0SnMU register
 */
/*@{*/
#define HW_FMC_DATAW0SnMU_COUNT (4U)

#define HW_FMC_DATAW0SnMU_ADDR(x, n) ((x) + 0x204U + (0x10U * (n)))

#define HW_FMC_DATAW0SnMU(x, n)  (*(__IO hw_fmc_dataw0snmu_t *) HW_FMC_DATAW0SnMU_ADDR(x, n))
#define HW_FMC_DATAW0SnMU_RD(x, n) (HW_FMC_DATAW0SnMU(x, n).U)
#define HW_FMC_DATAW0SnMU_WR(x, n, v) (HW_FMC_DATAW0SnMU(x, n).U = (v))
#define HW_FMC_DATAW0SnMU_SET(x, n, v) (HW_FMC_DATAW0SnMU_WR(x, n, HW_FMC_DATAW0SnMU_RD(x, n) |  (v)))
#define HW_FMC_DATAW0SnMU_CLR(x, n, v) (HW_FMC_DATAW0SnMU_WR(x, n, HW_FMC_DATAW0SnMU_RD(x, n) & ~(v)))
#define HW_FMC_DATAW0SnMU_TOG(x, n, v) (HW_FMC_DATAW0SnMU_WR(x, n, HW_FMC_DATAW0SnMU_RD(x, n) ^  (v)))
/*@}*/

